{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "(": 5,
      ")": 6,
      "1": 7,
      "2": 8,
      "=": 9,
      "@": 10,
      "C": 11,
      "H": 12,
      "K": 13,
      "N": 14,
      "O": 15,
      "S": 16,
      "U": 17,
      "[": 18,
      "]": 19,
      "CC": 20,
      "@@": 21,
      "](": 22,
      "(=": 23,
      ")=": 24,
      "CCC": 25,
      "]([": 26,
      "CC1": 27,
      "NC": 28,
      "C1": 29,
      "NCC": 30,
      "N1": 31,
      "))": 32,
      "CO": 33,
      "CCN": 34,
      "CCCCN": 35,
      "CCCNC": 36,
      "CCC1": 37,
      "CNC": 38,
      "SC": 39,
      "CCSC": 40,
      "CS": 41,
      "C2": 42,
      "C1C": 43,
      "CNC2": 44,
      ")[": 45,
      "NK": 46,
      "UNK": 47,
      "UNKN": 48,
      "UNKNCC": 49
    },
    "merges": [
      "C C",
      "@ @",
      "] (",
      "( =",
      ") =",
      "CC C",
      "]( [",
      "CC 1",
      "N C",
      "C 1",
      "N CC",
      "N 1",
      ") )",
      "C O",
      "CC N",
      "CC CCN",
      "CCC NC",
      "CCC 1",
      "C NC",
      "S C",
      "CC SC",
      "C S",
      "C 2",
      "C1 C",
      "CNC 2",
      ") [",
      "N K",
      "U NK",
      "UNK N",
      "UNK NCC"
    ]
  }
}